fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_АктыПоВыполненнымРаботам</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Строка = ДанныеДокумента.Добавить();
		Строка.ДатаРабот = Объект.ДатаПроведенияРабот;
		Строка.ВремяНачала = Объект.ВремяНачалаРабот;
		Строка.ВремяОкончания = Объект.ВремяОкончанияРабот;
		Строка.Специалист = Объект.Специалист;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	Оповестить("Запись_ВКМ_ОбслуживаниеКлиента", , Объект.Ссылка);
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		НоваяЗаявка = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НоваяЗаявка.ТекстСообщения = СтрШаблон("Новая заявка для специалиста %1, на дату %2, с %3 до %4", Объект.Специалист, Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"), Формат(Объект.ВремяНачалаРабот, "ДЛФ=T"), Формат(Объект.ВремяОкончанияРабот, "ДЛФ=T")); 
		НоваяЗаявка.Записать();
		
		Строка = ДанныеДокумента.Добавить();
		Строка.ДатаРабот = Объект.ДатаПроведенияРабот;
		Строка.ВремяНачала = Объект.ВремяНачалаРабот;
		Строка.ВремяОкончания = Объект.ВремяОкончанияРабот;
		Строка.Специалист = Объект.Специалист;
		
	ИначеЕсли Объект.Специалист <> ДанныеДокумента[0].Специалист ИЛИ Объект.ДатаПроведенияРабот <> ДанныеДокумента[0].ДатаРабот ИЛИ Объект.ВремяНачалаРабот <> ДанныеДокумента[0].ВремяНачала ИЛИ Объект.ВремяОкончанияРабот <> ДанныеДокумента[0].ВремяОкончания Тогда
		
		ТекстСообщения = СтрШаблон("По заявке № %1 изменились данные:", Формат(Число(Объект.Номер)));
		
		Если Объект.Специалист <> ДанныеДокумента[0].Специалист Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Специалист: %1", Объект.Специалист);
			ДанныеДокумента[0].Специалист = Объект.Специалист;
		КонецЕсли;
		
		Если Объект.ДатаПроведенияРабот <> ДанныеДокумента[0].ДатаРабот Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Дата проведения работ: %1", Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"));
			ДанныеДокумента[0].ДатаРабот = Объект.ДатаПроведенияРабот;
		КонецЕсли;
		
		Если Объект.ВремяНачалаРабот <> ДанныеДокумента[0].ВремяНачала Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Время начала работ: %1", Формат(Объект.ВремяНачалаРабот, "ДЛФ=T"));
			ДанныеДокумента[0].ВремяНачала = Объект.ВремяНачалаРабот;
		КонецЕсли; 
		
		Если Объект.ВремяОкончанияРабот <> ДанныеДокумента[0].ВремяОкончания Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Время окончания работ: %1", Формат(Объект.ВремяОкончанияРабот, "ДЛФ=T"));
			ДанныеДокумента[0].ВремяОкончания = Объект.ВремяОкончанияРабот;
		КонецЕсли;
		
		НоваяЗаявка = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НоваяЗаявка.ТекстСообщения = ТекстСообщения; 
		НоваяЗаявка.Записать(); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
